Revit 2024 API
FabricationPart.GetDimensionCalculatedOptions Method
 Gets the calculated options of the fabrication dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<string> GetDimensionCalculatedOptions(
	FabricationDimensionDefinition dim
)
Visual Basic
Public Function GetDimensionCalculatedOptions ( _
	dim As FabricationDimensionDefinition _
) As IList(Of String)
Visual C++
public:
IList<String^>^ GetDimensionCalculatedOptions(
	FabricationDimensionDefinition^ dim
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrication dimension.
Return Value
 The calculated options of the fabrication dimension.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace